app/controllers/pages_controller.rb

  def show
    @page = Page.friendly.find(params[:id])
---
SELECT  "pages".* FROM "pages" WHERE "pages"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @page = Page.new(page_params)

    respond_to do |format|
      if @page.save
---
INSERT INTO "pages" ("title", "slug", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "rules"], ["slug", "rules"], ["content", "Test Rules Page"], ["created_at", "2018-05-17 01:33:28.036630"], ["updated_at", "2018-05-17 01:33:28.036630"]]