app/controllers/players_controller.rb

  def create
    @player = Player.new(player_params)

    respond_to do |format|
      if @player.save
---
INSERT INTO "players" ("firstname", "lastname", "nickname", "email", "role", "phone", "gender", "yes_hash", "no_hash", "password_digest", "duespaid", "reminder", "active", "hashdcp", "cangetemail", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)