app/controllers/sessions_controller.rb

SELECT  "players".* FROM "players" WHERE "players"."email" = ? LIMIT ?  [["email", "dalindquists@gmail.com"], ["LIMIT", 1]]
---
def create
  player = Player.find_by_email(params[:email])